# Project 2, Part 6, Preliminary analytics

University of California, Berkeley

Master of Information and Data Science (MIDS) program

w205 - Fundamentals of Data Engineering

Student: Landon Morin

Year: 2022

Semester: Spring

Section: 9

# Included Modules and Packages

Code cell containing your includes for modules and packages

In [2]:
import math
import numpy as np
import pandas as pd

import psycopg2

import json

import csv

from datetime import datetime as dt

from IPython.display import display, HTML

# Supporting code

Code cells containing any supporting code, such as connecting to the database, any functions, etc.  

Remember you can freely use any code from the labs. You do not need to cite code from the labs.

In [3]:
connection = psycopg2.connect(
    user = "postgres",
    password = "ucb",
    host = "postgres",
    port = "5432",
    database = "postgres"
)

In [4]:
cursor = connection.cursor()

In [5]:
#
# function to run a select query and return rows in a pandas dataframe
# pandas puts all numeric values from postgres to float
# if it will fit in an integer, change it to integer
#

def my_select_query_pandas(query, rollback_before_flag, rollback_after_flag):
    "function to run a select query and return rows in a pandas dataframe"
    
    if rollback_before_flag:
        connection.rollback()
    
    df = pd.read_sql_query(query, connection)
    
    if rollback_after_flag:
        connection.rollback()
    
    # fix the float columns that really should be integers
    
    for column in df:
    
        if df[column].dtype == "float64":

            fraction_flag = False

            for value in df[column].values:
                
                if not np.isnan(value):
                    if value - math.floor(value) != 0:
                        fraction_flag = True

            if not fraction_flag:
                df[column] = df[column].astype('Int64')
    
    return(df)

# 2.6.1 Total dollar amount of sales

Write a query to sum the total_amount in the stage_1_peak_sales table and present the sum in a Pandas dataframe with appropriate column header name.

It is fine to leave the sum as is.  You do not have to format it or put in dollar signs.

Remember that you need to convert varchars to numeric using column::numeric before doing any math on them.

Pattern your code after the examples in the labs.  You may use as many code cells as you need.

In [9]:
rollback_before_flag = True
rollback_after_flag = True

query  = """

select sum(total_amount::numeric) as total_sales
from stage_1_peak_sales



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   total_sales
0         6480

# 2.6.2 Total number of sales

Write a query to count the total number of sales in the stage_1_peak_sales table and present the sum in a Pandas dataframe with appropriate column header name.  Each record in the stage_1_peak_sales table is a sale.

It is fine to leave the count as is.  You do not have to format it.

Pattern your code after the examples in the labs.  You may use as many code cells as you need.

In [12]:
rollback_before_flag = True
rollback_after_flag = True

query  = """

select count(sale_id) as number_sales
from stage_1_peak_sales



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   number_sales
0            97

# 2.6.3 Total dollar amount of sales, total cut paid to Peak, net to AGM

AGM is paying Peak an 18% cut to deliver the meals.

Write a query to calculate the total dollar amount of sales, the total cut paid to Peak, and the net to AGM.  

You may want to round to 2 decimal places for the total cut paid to Peak and the net to AGM, as they will be decimal.  

You do not need to format the numers with commas, dollar signs, etc.

Remember that you need to convert varchars to numeric using column::numeric before doing any math on them.

Pattern your code after the examples in the labs.  You may use as many code cells as you need.

In [15]:
rollback_before_flag = True
rollback_after_flag = True

query  = """

select sum(total_amount::numeric) as total_sales,
       round(sum(total_amount::numeric)*.18, 2) as cut_to_peak,
       round((sum(total_amount::numeric) - sum(total_amount::numeric)*.18), 2) as net_to_agm
from stage_1_peak_sales



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   total_sales  cut_to_peak  net_to_agm
0         6480       1166.4      5313.6

# 2.6.4 Total number of meals sold

Write a query to sum the quantity in the stage_1_peak_line_items table and present the sum in a Pandas dataframe with appropriate column header name

It is fine to leave the number as is.  You do not have to format it.

Remember that you need to convert varchars to numeric using column::numeric before doing any math on them.

Pattern your code after the examples in the labs.  You may use as many code cells as you need.

In [17]:
rollback_before_flag = True
rollback_after_flag = True

query  = """

select sum(quantity::numeric) as total_meals_sold
from stage_1_peak_line_items



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   total_meals_sold
0               540

# 2.6.5 Total number of meals sold by meal

Expanding on the last query, group the sum of quantity by meal.  Display the meal followed by the number of meals sold. 

Sort by highest number sold first.

Note that you will need to use the peak_product_mapping table and the products table in addition to the stage_1_peak_line_items table.

It is fine to leave the numbers as is.  You do not have to format them.

Remember that you need to convert varchars to numeric using column::numeric before doing any math on them.

Pattern your code after the examples in the labs.  You may use as many code cells as you need.

In [ ]:
rollback_before_flag = True
rollback_after_flag = True

query  = """

select count(sale_id) as number_sales
from stage_1_peak_sales



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

# 2.6.6 Average number of meals per sale

Write a query to find the average number of meals per sale, which should be equal to the total number of meals sold divided by the total number of sales, both of which we have calculated before.

You may want to round to 1 decimal place.

Remember that you need to convert varchars to numeric using column::numeric before doing any math on them.

Pattern your code after the examples in the labs.  You may use as many code cells as you need.